;;;  -*- lexical-binding: t; -*-

(package! emacs-snippets :recipe (:fetcher github :repo "hlissner/emacs-snippets" :files ("*")))
(package! pinentry)
(package! helpful)
(package! tldr)
(package! parinfer)
(package! lispy)
(package! lispyville)
(package! sed-mode)
(package! company)
(package! company-childframe)
(package! company-statistics)
(package! company-dict)
(package! ov)
(package! alert)
(package! ess)
(package! shr-tag-pre-highlight)
(package! orgit)
(package! evil-magit)
(package! magithub)
(package! electric-operator)
(package! lsp-mode)
(package! company-lsp)
(package! lsp-ui)
(package! lispy)
(package! lispyville)
(package! ivy-posframe)
(package! flycheck-posframe)
(package! evil-collection)
(package! academic-phrases)
(package! dired-k :disable t)
(package! flycheck-popup-tip :disable t)
(package! flycheck-pos-tip :disable t)
(package! flycheck-pos-tip :disable t)
(package! exec-path-from-shell :disable t)
(package! ob-mongo :disable t)
(package! ob-sql-mode :disable t)
(package! ob-translate :disable t)
(package! ob-translate :disable t)
(package! worf)
(package! function-args)
(package! zoutline)
;; (package! realgud)
